//
//  YLAlgoBitListRow_2.swift
//  YLNote
//
//  Created by tangh on 2022/3/10.
//  Copyright © 2022 tangh. All rights reserved.
//

import UIKit
/**

 颠倒给定的 32 位无符号整数的二进制位。

 提示：

 请注意，在某些语言（如 Java）中，没有无符号整数类型。在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，因为无论整数是有符号的还是无符号的，其内部的二进制表示形式都是相同的。
 在 Java 中，编译器使用二进制补码记法来表示有符号整数。因此，在 示例 2 中，输入表示有符号整数 -3，输出表示有符号整数 -1073741825。
  

 示例 1：
 输入：n = 00000010100101000001111010011100
 输出：964176192 (00111001011110000010100101000000)
 解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
      因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
   
 示例 2：
 输入：n = 11111111111111111111111111111101
 输出：3221225471 (10111111111111111111111111111111)
 解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
      因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。
  
 来源：力扣（LeetCode）
 链接：https://leetcode.cn/problems/reverse-bits
 */


class YLAlgoBitListRow_2: YLBaseTableViewController {

    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
    }
    
    @objc func testMethod_1() {
        let res = method_1(24)
        print("🍎1：\(res)")

    }
    
    
    /// 时间复杂度：O(log n), 空间复杂度： O(1)。
    /// - Parameter num: <#num description#>
    /// - Returns: <#description#>
    func method_1(_ num:Int) -> Int {
        var res = 0
        var num = num
        var i = 31
        while num != 0 {
            let x = num & 1
            res |= x<<i
            num >>= 1
            i-=1;
        }

        return res
    }

    //MARK: override
    override func fileName() -> String {
        return "Algo_bit_row_2"
    }
}
